# JOINS SQL

#  Inner Join:

## inner join hands-on

In [ ]:
SELECT players01.player_id, employees.first_name
fROM players01
INNER JOIN employees
ON  players01.player_id = employees.employee_id;

In [ ]:
SELECT pl.player_id, em.first_name
fROM players01 AS pl
INNER JOIN employees as em
ON  pl.player_id = em.employee_id;

# Lelft Join

## Lelft Join hands-on

In [ ]:
SELECT players01.player_id, players01.last_name, employees.first_name
fROM players01 
LEFT JOIN employees 
ON  players01.player_id = employees.employee_id;

SELECT pl.player_id, pl.last_name, em.first_name
fROM players01 AS pl
LEFT JOIN employees as em
ON  pl.player_id = em.employee_id;

In [ ]:
SELECT pl.player_id, pl.first_name,pl.last_name,em.first_name
fROM players01 AS pl
LEFT JOIN employees as em
ON  pl.player_id = em.employee_id
ORDER by pl.first_name;

# Right Join

## Right Join hands-on

In [ ]:
SELECT pl.player_id, pl.first_name,pl.last_name,em.first_name, em.job
fROM players01 AS pl
RIGHT JOIN employees as em
ON  pl.player_id = em.employee_id
ORDER by em.first_name;

# Full outer Join

## Full outer Join hands- on

In [ ]:
SELECT pl.player_id, pl.first_name,pl.last_name,em.first_name, em.job
fROM players01 AS pl
FULL OUTER JOIN employees as em
ON  pl.player_id = em.employee_id;

In [ ]:
SELECT pl.player_id, pl.first_name,pl.last_name,em.first_name, em.job
fROM players01 AS pl
FULL  JOIN employees as em
ON  pl.player_id = em.employee_id;

# Views (virtuel tables)

In [ ]:
CREATE VIEW some_players AS
SELECT player_id, first_name, rating
from players01
WHERE rating > 90;

In [ ]:
select * 
from some_players

## CREATE or REPLACE VIEW bay change the condition

In [ ]:
CREATE or REPLACE VIEW some_players AS
SELECT player_id, first_name, rating
from players01
WHERE rating > 91;

In [ ]:
SELECT * FROM some_players

In [ ]:
drop VIEW some_players;

# PROJECT SQL:

    1-Open the SQL Manager and create a table called employees to store data of employees.
    In the employees table create six columns
        employee_id
        first_name
        last_name
        age
        job
        salary.
    Use primary key, not null ans serial constraints.

    The employee_id, age and salary columns are int data type, and first_name, last_name and
    job are string data type.

    2- Let's add data to the employees table, use the insert into statement. Try to add 10 records with values for each
    column.
    
    3- Update the existing table : 
        Retrieve data using select.
        filter the result using where filter the result using having with aggregates functions
        create a view special_employees from the employees table and update it.
        create a new table called assistants based on the employees table to create acopy if the existing data

# Mon projet SQL :

    1-Ouvrez le gestionnaire SQL et créez une table appelée employés pour stocker les données des employés.
    Dans la table employés, créez six colonnes
        employee_id
        first_name
        last_name
        age
        job
        salary.
    Utilisez une clé primaire, pas  de valeurs nulles et des contraintes  en serie.

    Les colonnes employee_id, age et salary sont de type de données int, et first_name, last_name et
    job sont de type de données string.

    2- Ajoutons des données à la table employés, utilisons l'instruction insert into. Essayez d'ajouter 10 enregistrements avec des valeurs pour chaque
    colonne.

    3- Mettez à jour la table existante :
        Récupérez les données à l'aide de select.
        Filtrez le résultat à l'aide de where Filtrez le résultat à l'aide de having avec des fonctions d'agrégation
        Créez une vue special_employees à partir de la table employés et mettez-la à jour.
        Créez une nouvelle table appelée assistants basée sur la table employés pour créer une copie des données existantes

#  1-

In [ ]:
CREATE TABLE employees_ro2(
employeero_id serial  PRIMARY key  NOT NULL,
first_namero VARCHAR(50) not NULL,
last_namro VARCHAR(50) NOT NULL,
age_ro INT NOT NULL,
job_ro VARCHAR(100) NOT NULL,
salary_ro INT NOT NULL);

In [ ]:
CREATE TABLE employees_ro1(
employeero_id int PRIMARY key  NOT NULL,
first_namero VARCHAR(50) not NULL,
last_namro VARCHAR(50) NOT NULL,
age_ro INT NOT NULL,
job_ro VARCHAR(100) NOT NULL,
salary_ro INT NOT NULL);

In [ ]:
CREATE TABLE employees_ro2(
employeero_id int  NOT NULL,
first_namero VARCHAR(50) not NULL,
last_namro VARCHAR(50) NOT NULL,
age_ro INT NOT NULL,
job_ro VARCHAR(100) NOT NULL,
salary_ro INT NOT NULL);

# 2-

In [ ]:
INSERT INTO employees_ro1(employeero_id,first_namero,last_namro,age_ro,job_ro,salary_ro)
VALUES
(1,'Celestine','Miakoukila',66,'vendeuse',250),
(2,'Guillaume','BOUNAMARI',76,'Docteur',202),
(3,'Arnaud Christel','Matondo',49,'pombier aerodrome',1500),
(4,'Eric Dave','BOUNAMARI',44,'enseignant pompier',1800),
(5,'Ese rucia','Nkouka',38,'charge des clientèles',1900),
(6,'Aris Sandra','BOUNAMARI',35,'chauffeur de taxi',200),
(7,'Rodolphe', 'BOUNAMARI',29,'Data Analyst',3000),
(8,'Rose Marie Mercia', 'BOUNAMARI',25, 'femme daffaire',500),
(9,'Rodna', 'BOUNAMARI',10,'Data scientist',300),
(10,'Noor', 'BOUNAMARI',5, 'basketball',100);

# Pour voir les données de  la table

In [ ]:
SELECT *
from employees_ro1;

# 3-
    Mettez à jour la table existante :
    a- Récupérez les données à l'aide de select.
    b- Filtrez le résultat à l'aide de where 
    c- Filtrez le résultat à l'aide de having avec des fonctions d'agrégation
    d- Créez une vue special_employees à partir de la table employés et mettez-la à jour.
    e- Créez une nouvelle table appelée assistants basée sur la table employés pour créer une copie des données existantes

    a- Récupérez les données à l'aide de select.

In [ ]:
SELECT *
from employees_ro1;

    b- Filtrez le résultat à l'aide de where

In [ ]:
SELECT *
from employees_ro1
where salary_ro >= 200;

    c- Filtrez le résultat à l'aide de having avec des fonctions d'agrégation

In [ ]:
# Having sans fonctions d'aggregation
SELECT employeero_id,salary_ro
from employees_ro1
GROUP by employeero_id, salary_ro
HAVING salary_ro < 1800;



# Having avec fonctions d'aggregation
SELECT COUNT(employeero_id),last_namro
from employees_ro1
GROUP by employeero_id, last_namro
HAVING COUNT(employeero_id) < 12 ;

    d- Créez une vue special_employees à partir de la table employés et mettez-la à jour.

In [ ]:
# Creation de la View 

CREATE VIEW special_employees AS
SELECT employeero_id,last_namro,age_ro
FROM employees_ro1
WHERE age_ro >= 36;

# vue de la view 
select *
from special_employees

# Mise à  jour de la view creée

CREATE  or replace VIEW special_employees AS
SELECT employeero_id,last_namro,age_ro
FROM employees_ro1
WHERE age_ro <= 36;

# vue de la view 
select *
from special_employees

    e- Créez une nouvelle table appelée assistants basée sur la table employés pour créer une copie des données existantes

In [ ]:
 CREATE TABLE la_famille_Bounamari
 AS(
   	SELECT employeero_id ,first_namero, last_namro
  	FROM employees_ro1
  	WHERE last_namro = 'BOUNAMARI'
 	);

In [ ]:
  SELECT *
    from la_famille_bounamari;

In [ ]:
CREATE TABLE la_famille_MIAKOUKILA
 AS(
   	SELECT employeero_id ,first_namero, last_namro
  	FROM employees_ro1
  	WHERE last_namro != 'BOUNAMARI'
 	);

In [ ]:
 SELECT *
  from la_famille_MIAKOUKILA;